Catalogs/ЭлектронныеКурсы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ЭлектронныеКурсы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерРедакции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВерсии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПоставщикиЭлектронныхКурсов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтартоваяСтраница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УдалитьТекстыЭлектронныхКурсов</v8:Type>
						<v8:Type>cfg:CatalogRef.ЭлектронныеРесурсы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФинальнаяСтраница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УдалитьТекстыЭлектронныхКурсов</v8:Type>
						<v8:Type>cfg:CatalogRef.ЭлектронныеРесурсы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЭлектронныхКурсов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СправочнаяИнформация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УдалитьТекстыЭлектронныхКурсов</v8:Type>
						<v8:Type>cfg:CatalogRef.ЭлектронныеРесурсы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Глоссарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭлектронныеГлоссарии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Презентация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭлектронныеРесурсы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецЭлектронногоКурса</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВладелецЭлектронногоКурса</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ИмпортированныеЭлементыЭлектронныхКурсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИмпортированныеЭлементыЭлектронныхКурсов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИдентификаторПакета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>120</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторЭлемента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>120</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяЭлемента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИмпортированныйЭлемент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭлектронныеРесурсы</v8:Type>
						<v8:Type>cfg:CatalogRef.ЭлектронныеКурсы</v8:Type>
						<v8:Type>cfg:CatalogRef.СодержаниеЭлектронныхКурсов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыЭлементовЭлектронныхРесурсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыЭлементовЭлектронныхРесурсов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>File</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Folder</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Media</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Image</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Video</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Audio</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Document</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DataProcessor</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Text</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Presentation</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Table</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>YouTube</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>HTML</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ФорматыВыгрузкиЭлектронныхКурсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ФорматыВыгрузкиЭлектронныхКурсов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>HTML</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SCORM</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолнаяКопия</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ЭлектронныеКурсы/Forms/ФормаЗагрузки/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	#Если НЕ ВебКлиент И НЕ МобильныйКлиент Тогда		
	Если СтандартныеПодсистемыКлиент.ПараметрыРаботыКлиента().ИнформационнаяБазаФайловая Тогда
		КурсыНаКлиенте = Истина;
	КонецЕсли;		
	#КонецЕсли

	Элементы.ФормаНайтиКурсыВПапке.Видимость = КурсыНаКлиенте;
	УстановитьВидимостьПредупреждений();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ЭлектронныеКурсыЗагружатьПриИзменении(Элемент)
	УстановитьВидимостьПредупреждений();
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ВыбратьАрхивСКурсами(Команда)	
	
	#Если ВебКлиент ИЛИ МобильныйКлиент Тогда
		
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьАрхивСКурсамиВПродолжение", ЭтотОбъект);
	НачатьПомещениеФайла(ОписаниеОповещения,,, Истина, УникальныйИдентификатор);
	
	#Иначе
		
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьАрхивСКурсамиВТонкомКлиентеПродолжение", ЭтотОбъект);
	
	МассивТиповВыбора = Новый Массив;
	МассивТиповВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ТипыЭлементовЭлектронныхРесурсов.Folder"));
	
	ДиалогВыбораФайлов = РазработкаЭлектронныхКурсовСлужебныйКлиент.ДиалогВыбораФайлаПоТипу(
		МассивТиповВыбора,
		НСтр("ru = 'Выберите архив с одним или несколькими курсами'"),
		НСтр("ru = 'Архив ZIP'"));
	
	ДиалогВыбораФайлов.МножественныйВыбор = Ложь;
	ДиалогВыбораФайлов.Показать(ОписаниеОповещения);
	
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьАрхивСКурсамиВТонкомКлиентеПродолжение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт	

	#Если НЕ ВебКлиент И НЕ МобильныйКлиент Тогда

	Если ВыбранныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьАрхивСКурсамиВПродолжение", ЭтотОбъект);
	НачатьПомещениеФайла(ОписаниеОповещения,, ВыбранныеФайлы[0], Ложь, УникальныйИдентификатор);
	
	#КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьАрхивСКурсамиВПродолжение(Результат, АдресФайла, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт

	Если НЕ Результат Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураИмениФайла = ОбщегоНазначенияКлиентСервер.РазложитьПолноеИмяФайла(ВыбранноеИмяФайла);	
	Если НРег(СтруктураИмениФайла.Расширение) <> ".zip" Тогда
		ВызватьИсключение НСтр("ru = 'Загрузите файл zip'");
	КонецЕсли;	
	РазместитьАрхивZIPСКурсамиНаСервере(АдресФайла, ВыбранноеИмяФайла);
	УстановитьВидимостьПредупреждений();
	
КонецПроцедуры

&НаСервере
Процедура РазместитьАрхивZIPСКурсамиНаСервере(АдресФайлаВоВременномХранилище, ПутьКФайлу)
	
	// Распаковываем архив с курсами
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресФайлаВоВременномХранилище);

	ИмяВременногоФайлаZIP = ПолучитьИмяВременногоФайла("zip");	
	ДвоичныеДанные.Записать(ИмяВременногоФайлаZIP);
	
	ПутьКВременномуКаталогуНаСервере = ПолучитьИмяВременногоФайла(""); // Реквизит формы
	ЭлектронноеОбучениеСлужебныйКлиентСервер.НовыйКаталог(ПутьКВременномуКаталогуНаСервере);	
	ПутьКВременномуКаталогуНаСервере = ЭлектронноеОбучениеСлужебныйКлиентСервер.ДобавитьКонечныйРазделительПути(ПутьКВременномуКаталогуНаСервере);	
	
	ФайлАрхива = Новый ЧтениеZIPФайла(ИмяВременногоФайлаZIP);
	ФайлАрхива.ИзвлечьВсе(ПутьКВременномуКаталогуНаСервере,  РежимВосстановленияПутейФайловZIP.Восстанавливать);
	ФайлАрхива.Закрыть();
	ЭлектронноеОбучениеСлужебный.УдалитьВременныйФайл(ИмяВременногоФайлаZIP);
	
	// Получаем списки курсов из каталога с курсами
	ПутьКФайлу = ЭлектронноеОбучениеСлужебныйКлиентСервер.ДобавитьКонечныйРазделительПути(ПутьКФайлу);
	СписокДоступныхКурсов = СписокДоступныхКурсовВКаталоге(ПутьКВременномуКаталогуНаСервере, ПутьКФайлу, ЭтотОбъект, Истина);
	ЗаполнитьТаблицуКурсов(СписокДоступныхКурсов);
	
	//ЭлектронноеОбучениеСлужебный.УдалитьВременныйФайл(ПутьКВременномуКаталогуНаСервере);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьВБазу(Команда)
	
	ЕстьКурсыДляЗамены = Ложь;
	ЕстьКурсыДляЗаменыНовых = Ложь;
	
	ОпределитьЕстьЛиКурсыДляЗамены(ЕстьКурсыДляЗамены, ЕстьКурсыДляЗаменыНовых);
	Если ЕстьКурсыДляЗамены ИЛИ ЕстьКурсыДляЗаменыНовых Тогда		
		ТекстВопроса = ?(ЕстьКурсыДляЗаменыНовых, НСтр("ru = 'Заменить новые курсы в базе старыми с диска?'"), НСтр("ru = 'Заменить курсы в базе?'"));
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузитьВБазуПродолжение", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 0);		
	Иначе
		ЗагрузитьВБазуОкончание();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьВБазуПродолжение(РезультатВопроса, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
	    Возврат;
	КонецЕсли;

	ЗагрузитьВБазуОкончание();    

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьВБазуОкончание()
	
	Доступность = Ложь; // Блокируем все
	
	Состояние(НСтр("ru = 'Подождите, выполняется загрузка курсов. Это может занять длительное время.'"));
	КоличествоЗагруженных = ЗаписатьКурсыВБазу();
	
	СтрокиДляУдаления = ЭлектронныеКурсы.НайтиСтроки(Новый Структура("ВременныйКаталог", Истина));
	Для Каждого Строка Из СтрокиДляУдаления Цикл
		ЭлектронноеОбучениеСлужебныйКлиент.УдалитьВременныйФайл(Строка.ПутьККаталогу);
	КонецЦикла;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузитьВБазуПослеИнформирования", ЭтотОбъект);
	Если КоличествоЗагруженных > 0 Тогда
		Оповестить("ЭлектронныйКурсЗаписан");
		ПоказатьПредупреждение(ОписаниеОповещения, НСтр("ru = 'Загрузка завершена'"));
	Иначе
		ПоказатьПредупреждение(ОписаниеОповещения, НСтр("ru = 'Отсутствуют элементы для загрузки'"));
	КонецЕсли;    	
		
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьВБазуПослеИнформирования(ДополнительныеПараметры) Экспорт	
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура НайтиКурсыВПапке(Команда)
	ВыбратьКаталогДляСКурсамиНаКлиенте();
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Процедура ВыбратьКаталогДляСКурсамиНаКлиенте()
	
	#Если НЕ ВебКлиент И НЕ МобильныйКлиент Тогда

	Если КурсыНаКлиенте Тогда
		
		ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
		ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
		ДиалогОткрытияФайла.Заголовок = НСтр("ru = 'Выберите каталог для поиска в нем курсов'");
		
		Если ДиалогОткрытияФайла.Выбрать() Тогда
			ПутьККаталогуСКурсами = ДиалогОткрытияФайла.Каталог;			
			ПутьККаталогуСКурсами = ЭлектронноеОбучениеСлужебныйКлиентСервер.ДобавитьКонечныйРазделительПути(ПутьККаталогуСКурсами);
			ПослеВыбораКаталогаДляСКурсамиНаКлиенте(ПутьККаталогуСКурсами);
		КонецЕсли;		
		
	Иначе
		
		ВызватьИсключение НСтр("ru = 'Функциональность не поддерживается'");
		
	КонецЕсли;
	
	#КонецЕсли
		
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораКаталогаДляСКурсамиНаКлиенте(ПутьККаталогуСКурсами)

	СписокДоступныхКурсов = СписокДоступныхКурсовВКаталоге(ПутьККаталогуСКурсами, ПутьККаталогуСКурсами, ЭтотОбъект);
	ЗаполнитьТаблицуКурсов(СписокДоступныхКурсов);
	УстановитьВидимостьПредупреждений();	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуКурсов(Знач СписокДоступныхКурсов)
	
	МассивЭлектронныхКурсовНаДиске = Новый Массив;
	Для каждого СвойстваКурса Из СписокДоступныхКурсов Цикл
		
		ЭлектронныйКурс = Справочники.ЭлектронныеКурсы.ПолучитьСсылку(Новый УникальныйИдентификатор(СвойстваКурса.Идентификатор));
		
		Если ЗначениеЗаполнено(ЭлектронныйКурс) И МассивЭлектронныхКурсовНаДиске.Найти(ЭлектронныйКурс) <> Неопределено Тогда
			ЭлектронныеКурсы.Очистить();
			ТекстСообщения =  СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Электронный курс ""%1"" доступен в нескольких экземплярах. Загрузка не может быть выполнена.'"), СвойстваКурса.Наименование);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецЕсли;
		
		СвойстваКурсаВБазе = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЭлектронныйКурс, "Ссылка, ДатаИзменения");
		
		НоваяСтрока = ЭлектронныеКурсы.Добавить();
		НоваяСтрока.Наименование = СвойстваКурса.Наименование;
		НоваяСтрока.ПутьКФайлуМанифеста = СвойстваКурса.ПутьКФайлуМанифеста;
		НоваяСтрока.ДатаИзмененияНаДиске = СвойстваКурса.ДатаИзменения;
		НоваяСтрока.ПутьККаталогу = СвойстваКурса.ПутьККаталогу;
		НоваяСтрока.Формат = СвойстваКурса.Формат;
		НоваяСтрока.ПутьКАрхиву = СвойстваКурса.ПутьКАрхиву;
		
		Если ЗначениеЗаполнено(СвойстваКурсаВБазе.Ссылка) Тогда
			НоваяСтрока.ЭлектронныйКурс = ЭлектронныйКурс;
			НоваяСтрока.ДатаИзмененияВБазе = СвойстваКурсаВБазе.ДатаИзменения;
		КонецЕсли;		
		
		Если НЕ ЗначениеЗаполнено(СвойстваКурсаВБазе.Ссылка) 
			ИЛИ (ЗначениеЗаполнено(СвойстваКурсаВБазе.Ссылка) 
			И СвойстваКурса.ДатаИзменения > СвойстваКурсаВБазе.ДатаИзменения) Тогда
			// Загружаем по умолчанию, если курса нет в базе или он более новый
			НоваяСтрока.Загружать = Истина;
		КонецЕсли;
		НоваяСтрока.ВременныйКаталог = СвойстваКурса.ВременныйКаталог;
		
		МассивЭлектронныхКурсовНаДиске.Добавить(ЭлектронныйКурс);
		
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста 
Функция СписокДоступныхКурсовВКаталоге(Знач ПутьККаталогу, ПутьКАрхиву, Форма, ВременныйКаталог = Ложь)
	
	#Если НЕ ВебКлиент И НЕ МобильныйКлиент Тогда
		
	ДоступныеКурсы = Новый Массив;
	
	// Ищем файлы манифеста с полными выгрузками курсов
	
	ФайлыМанифеста1С = ЭлектронноеОбучениеСлужебныйКлиентСервер.ИскатьФайлы(ПутьККаталогу, "v8course.json", Истина);
	
	Для каждого ФайлМанифеста Из ФайлыМанифеста1С Цикл
	
		Чтение = Новый ЧтениеJSON;
	    Чтение.ОткрытьФайл(ФайлМанифеста.ПолноеИмя);
		СтруктураМанифеста = ПрочитатьJSON(Чтение);
	    Чтение.Закрыть();
		
		СвойстваКурса = ПустаяСтруктураСвойствКурса();
		СвойстваКурса.Идентификатор = СтруктураМанифеста.UUID;
		СвойстваКурса.Наименование = СтруктураМанифеста.Title;
		СвойстваКурса.ДатаИзменения = ПрочитатьДатуJSON(СтруктураМанифеста.CourseModifiedDate.Value, ФорматДатыJSON.ISO);
		Если ПутьККаталогу = ПутьКАрхиву Тогда
			СвойстваКурса.ПутьКФайлуМанифеста = ФайлМанифеста.ПолноеИмя;
			СвойстваКурса.ПутьККаталогу = ФайлМанифеста.Путь;
		Иначе
			СвойстваКурса.ПутьКФайлуМанифеста = СтрЗаменить(ФайлМанифеста.ПолноеИмя, ПутьККаталогу, ПутьКАрхиву);
			СвойстваКурса.ПутьККаталогу = СтрЗаменить(ФайлМанифеста.Путь, ПутьККаталогу, ПутьКАрхиву);
			СвойстваКурса.ПутьКАрхиву = ПутьКАрхиву;
		КонецЕсли;
		СвойстваКурса.Формат = ПредопределенноеЗначение("Перечисление.ФорматыВыгрузкиЭлектронныхКурсов.ПолнаяКопия");
		СвойстваКурса.ВременныйКаталог = ВременныйКаталог;
		
		ДоступныеКурсы.Добавить(СвойстваКурса);
		
	КонецЦикла;
	
	// Ищем архивы zip с курсами SCORM
	
	ФайлыZIP = ЭлектронноеОбучениеСлужебныйКлиентСервер.ИскатьФайлы(ПутьККаталогу, "*.zip", Ложь);
	
	Для каждого ФайлZIP Из ФайлыZIP Цикл
		
		// Распаковываем пакет SCORM
		
		ФайлАрхива = Новый ЧтениеФайлаАрхива(ФайлZIP.ПолноеИмя);
		
		ЭлементМанифеста = ФайлАрхива.Элементы.Найти("imsmanifest.xml");
		
		Если ЭлементМанифеста = Неопределено Тогда
			ФайлАрхива.Закрыть();
			Продолжить; // Это не курс SCORM
		КонецЕсли;
		
		ПутьКВременномуКаталогу = ПолучитьИмяВременногоФайла("");
		ЭлектронноеОбучениеСлужебныйКлиентСервер.НовыйКаталог(ПутьКВременномуКаталогу);
		ПутьКВременномуКаталогу = ЭлектронноеОбучениеСлужебныйКлиентСервер.ДобавитьКонечныйРазделительПути(ПутьКВременномуКаталогу);
		
		ФайлАрхива.ИзвлечьВсе(ПутьКВременномуКаталогу, РежимВосстановленияПутейФайлаАрхива.Восстанавливать);
		ФайлАрхива.Закрыть();
		
		// Получаем текст файла манифеста
		
		ПутьКАрхиву = ЭлектронноеОбучениеСлужебныйКлиентСервер.ДобавитьКонечныйРазделительПути(ФайлZIP.ПолноеИмя);
		ПутьКФайлуМанифеста = ПутьКВременномуКаталогу + "imsmanifest.xml";
		СвойстваКурса = СвойстваКурсаSCORM(ПутьКФайлуМанифеста, ПутьКАрхиву, ВременныйКаталог); 
		
		Если СвойстваКурса <> Неопределено Тогда
			ДоступныеКурсы.Добавить(СвойстваКурса);
		КонецЕсли;
		
	КонецЦикла;
	
	// Ищем файлы imsmanifest.xml (без архива)
	
	ФайлыМанифестаSCORM = ЭлектронноеОбучениеСлужебныйКлиентСервер.ИскатьФайлы(ПутьККаталогу, "imsmanifest.xml", Истина);
	
	Для каждого ФайлМанифеста Из ФайлыМанифестаSCORM Цикл
		
		СвойстваКурса = СвойстваКурсаSCORM(ФайлМанифеста.ПолноеИмя,, ВременныйКаталог);
		Если СвойстваКурса <> Неопределено Тогда
			ДоступныеКурсы.Добавить(СвойстваКурса);
		КонецЕсли;
	
	КонецЦикла;
	
	Возврат Новый ФиксированныйМассив(ДоступныеКурсы);
	
	#КонецЕсли

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СвойстваКурсаSCORM(ПутьКФайлуМанифеста, ПутьКАрхиву = "", ВременныйКаталог = Ложь)
	
	#Если ВебКлиент ИЛИ МобильныйКлиент Тогда
		
	Возврат Неопределено;
		
	#Иначе

	ФайлМанифеста = Новый Файл(ПутьКФайлуМанифеста);
	
	Если НЕ ФайлМанифеста.Существует() Тогда
		ВызватьИсключение  СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Файл манифеста %1 не найден'"), ПутьКФайлуМанифеста);
	КонецЕсли;
	
	ЧтениеТекста = Новый ЧтениеТекста(ПутьКФайлуМанифеста, КодировкаТекста.UTF8);
	ТекстФайлаМанифеста = ЧтениеТекста.Прочитать();
	ЧтениеТекста.Закрыть();					
	
	// Получаем свойства курсов из манифеста (по числу organizations)
	
	СвойстваКурса = СвойстваМанифестаSCORM(ТекстФайлаМанифеста);
	
	Если СвойстваКурса = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СвойстваКурса.ДатаИзменения = ФайлМанифеста.ПолучитьВремяИзменения();
	Если ЗначениеЗаполнено(ПутьКАрхиву) Тогда
		СвойстваКурса.ПутьКФайлуМанифеста = СтрЗаменить(ПутьКФайлуМанифеста, ФайлМанифеста.Путь, ПутьКАрхиву);
		СвойстваКурса.ПутьККаталогу = ПутьКАрхиву;
		СвойстваКурса.ПутьКАрхиву = ПутьКАрхиву;
	Иначе
		СвойстваКурса.ПутьКФайлуМанифеста = ПутьКФайлуМанифеста;
		СвойстваКурса.ПутьККаталогу = ФайлМанифеста.Путь;
	КонецЕсли;
	СвойстваКурса.Формат = ПредопределенноеЗначение("Перечисление.ФорматыВыгрузкиЭлектронныхКурсов.SCORM");
	СвойстваКурса.ВременныйКаталог = ВременныйКаталог;
	
	Возврат СвойстваКурса;
	
	#КонецЕсли
	
КонецФункции

&НаСервереБезКонтекста 
Функция СвойстваМанифестаSCORM(Знач ТекстФайлаМанифеста)
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(ТекстФайлаМанифеста);
		
	МанифестТип  = ФабрикаXDTO.Тип("http://www.imsglobal.org/xsd/imscp_v1p1", "manifestType");
	МанифестXDTO = ФабрикаXDTO.Создать(МанифестТип);
	
	Попытка
		МанифестXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML, МанифестТип);
	Исключение
		ЭлектронноеОбучениеСлужебный.ЗаписатьОшибкуВЖурналРегистрации(НСтр("ru = 'Файл манифеста не соответствует стандарту SCORM 2004'"), ТекстФайлаМанифеста);
		Возврат Неопределено;
	КонецПопытки;
	
	СвойстваКурса = ПустаяСтруктураСвойствКурса();	
	
	ИдентификаторПакетаSCORM = МанифестXDTO.identifier;		
	
	Если НЕ ЗначениеЗаполнено(ИдентификаторПакетаSCORM) Тогда
		ЭлектронноеОбучениеСлужебный.ЗаписатьОшибкуВЖурналРегистрации(НСтр("ru = 'Отсутствует идентификатор пакета SCORM'"), ТекстФайлаМанифеста);
		Возврат Неопределено;		
	КонецЕсли;
	
	Если МанифестXDTO.organizations.organization.Количество() = 0 Тогда
		
		ЭлектронноеОбучениеСлужебный.ЗаписатьОшибкуВЖурналРегистрации(НСтр("ru = 'Файл манифеста не содержит организацию контента'"), ТекстФайлаМанифеста);
		Возврат Неопределено;
		
	Иначе
		
		Для каждого Организация Из МанифестXDTO.organizations.organization Цикл
			
			ИдентификаторКурса = Организация.identifier;
			НаименованиеКурса = Организация.title;
			
			Прервать; // Только первая organization 
			
		КонецЦикла;	
		
	КонецЕсли;
	
	СуществующийЭлектронныйКурс = РегистрыСведений.ИмпортированныеЭлементыЭлектронныхКурсов.РанееИмпортированныйЭлемент(ИдентификаторПакетаSCORM, "organization", ИдентификаторКурса);
	
	Если ЗначениеЗаполнено(СуществующийЭлектронныйКурс) Тогда
		СвойстваКурса.Идентификатор = Строка(СуществующийЭлектронныйКурс.УникальныйИдентификатор());
	Иначе
		СвойстваКурса.Идентификатор = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
	КонецЕсли;
	
	СвойстваКурса.Наименование = НаименованиеКурса;	
	
	Возврат СвойстваКурса;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПустаяСтруктураСвойствКурса()
	Возврат Новый Структура("Идентификатор, Наименование, ДатаИзменения, ПутьКФайлуМанифеста, ПутьККаталогу, УдалитьПослеЗагрузки, Формат, ПутьКАрхиву, ВременныйКаталог");
КонецФункции

&НаКлиенте
Функция ЗаписатьКурсыВБазу()
	
	Попытка
		КоличествоЗагруженных = 0;
		
		МассивЗагруженныхКурсов = Новый Массив;
		Для каждого Строка Из ЭлектронныеКурсы Цикл
		
			Если Строка.Загружать Тогда
				
				ЗагруженныйЭлектронныйКурс = Неопределено;
				ПутьКВременномуКаталогуНаСервере = "";
				ПутьКФайлуМанифеста = Строка.ПутьКФайлуМанифеста;
				Если ЗначениеЗаполнено(Строка.ПутьКАрхиву) Тогда
					ПутьКМанифесту = СтрЗаменить(Строка.ПутьКФайлуМанифеста, Строка.ПутьКАрхиву, "");
					#Если ВебКлиент Тогда
						ПараметрыФайла = Новый Структура("ПутьКАрхиву, ПутьКМанифесту, Формат", Строка.ПутьКАрхиву, ПутьКМанифесту, Строка.Формат);
						ФайловаяСистемаКлиент.ПодключитьРасширениеДляРаботы1СПредприятия(
							Новый ОписаниеОповещения("ПриПодключенииРасширенияРаботыСФайлами", ЭтотОбъект, ПараметрыФайла),
							"Для работы с файлами необходимо установить расширение", Истина);
					#Иначе
						ДвоичныеДанные = Новый ДвоичныеДанные(Строка.ПутьКАрхиву);
						АдресФайла = ПоместитьВоВременноеХранилище(ДвоичныеДанные, УникальныйИдентификатор);
						ЗагруженныйЭлектронныйКурс = ЗагрузитьДанныеКурса(АдресФайла, ПутьКМанифесту, Строка.Формат);
					#КонецЕсли
				ИначеЕсли Строка.Формат = ПредопределенноеЗначение("Перечисление.ФорматыВыгрузкиЭлектронныхКурсов.ПолнаяКопия") Тогда
					ЗагруженныйЭлектронныйКурс = РазработкаЭлектронныхКурсовСлужебныйКлиент.ЗагрузитьВБазуПолныйПакет(ПутьКФайлуМанифеста, ЭтотОбъект.УникальныйИдентификатор);
				ИначеЕсли Строка.Формат = ПредопределенноеЗначение("Перечисление.ФорматыВыгрузкиЭлектронныхКурсов.SCORM") Тогда
					ЗагруженныйЭлектронныйКурс = РазработкаЭлектронныхКурсовСлужебныйКлиент.ЗагрузитьВБазуПакетSCORM(ПутьКФайлуМанифеста, ЭтотОбъект.УникальныйИдентификатор);
				Иначе
					ВызватьИсключение НСтр("ru = 'Неизвестный формат пакета'");
				КонецЕсли;		
				
				Строка.Загружено = Истина;
				КоличествоЗагруженных = КоличествоЗагруженных + 1;			
				МассивЗагруженныхКурсов.Добавить(ЗагруженныйЭлектронныйКурс);
				
				Если ЗначениеЗаполнено(ПутьКВременномуКаталогуНаСервере) Тогда
					
					ЭлектронноеОбучениеСлужебныйКлиент.УдалитьВременныйФайл(ПутьКВременномуКаталогуНаСервере);
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	Исключение
	
		ЭлектронноеОбучениеСлужебныйКлиент.ЗаписатьОшибкуВЖурналРегистрации(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
		
	КонецПопытки;
	
	Возврат КоличествоЗагруженных;
	
КонецФункции

&НаСервере
Функция ЗагрузитьДанныеКурса(АдресАрхива, ПутьКМанифесту, Формат)
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресАрхива);
	ИмяВременногоФайлаZIP = ПолучитьИмяВременногоФайла("zip");
	ДвоичныеДанные.Записать(ИмяВременногоФайлаZIP);
	
	ПутьКВременномуКаталогуНаСервере = ПолучитьИмяВременногоФайла("");
	ЭлектронноеОбучениеСлужебныйКлиентСервер.НовыйКаталог(ПутьКВременномуКаталогуНаСервере);
	ПутьКВременномуКаталогуНаСервере = ЭлектронноеОбучениеСлужебныйКлиентСервер.ДобавитьКонечныйРазделительПути(ПутьКВременномуКаталогуНаСервере);
	
	ФайлАрхива = Новый ЧтениеZIPФайла(ИмяВременногоФайлаZIP);
	ФайлАрхива.ИзвлечьВсе(ПутьКВременномуКаталогуНаСервере, РежимВосстановленияПутейФайловZIP.Восстанавливать);
	ФайлАрхива.Закрыть();
	
	ПутьКФайлуМанифеста = ПутьКВременномуКаталогуНаСервере + ПутьКМанифесту;
	
	Если Формат = ПредопределенноеЗначение("Перечисление.ФорматыВыгрузкиЭлектронныхКурсов.ПолнаяКопия") Тогда
		ЗагруженныйЭлектронныйКурс = РазработкаЭлектронныхКурсовСлужебный.ЗагрузитьВБазуПолныйПакет(ПутьКФайлуМанифеста, ЭтотОбъект.УникальныйИдентификатор);
	ИначеЕсли Формат = ПредопределенноеЗначение("Перечисление.ФорматыВыгрузкиЭлектронныхКурсов.SCORM") Тогда
		ЗагруженныйЭлектронныйКурс = РазработкаЭлектронныхКурсовСлужебныйВызовСервера.ЗагрузитьВБазуПакетSCORMИзФайла(ПутьКФайлуМанифеста, ЭтотОбъект.УникальныйИдентификатор);
	Иначе
		ВызватьИсключение НСтр("ru = 'Неизвестный формат пакета'");
	КонецЕсли;
	
	Возврат ЗагруженныйЭлектронныйКурс;
	
КонецФункции

&НаКлиенте
Процедура ПриПодключенииРасширенияРаботыСФайлами(РасширениеРаботыСФайламиПодключено, ДополнительныеПараметры) Экспорт
	
	Если РасширениеРаботыСФайламиПодключено Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ПриСозданииДвоичныхДанных", ЭтотОбъект, ДополнительныеПараметры);
		НачатьСозданиеДвоичныхДанныхИзФайла(ОписаниеОповещения, ДополнительныеПараметры.ПутьКАрхиву);
	Иначе
		ВызватьИсключение НСтр("ru = 'Не удалось подключить расширение работы с файлами'");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриСозданииДвоичныхДанных(ДвоичныеДанные, ДополнительныеПараметры) Экспорт
	
	АдресФайла = ПоместитьВоВременноеХранилище(ДвоичныеДанные, Новый УникальныйИдентификатор);
	ЗагрузитьДанныеКурса(АдресФайла, ДополнительныеПараметры.ПутьКМанифесту, ДополнительныеПараметры.Формат);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьПредупреждений()
	
	ЕстьКурсыДляЗамены = Ложь;
	ЕстьКурсыДляЗаменыНовых = Ложь;
	
	ОпределитьЕстьЛиКурсыДляЗамены(ЕстьКурсыДляЗамены, ЕстьКурсыДляЗаменыНовых);
	
	Элементы.ГруппаПредупреждениеОЗаменеКурсов.Видимость = ЕстьКурсыДляЗамены И НЕ ЕстьКурсыДляЗаменыНовых;
	Элементы.ГруппаПредупреждениеОЗаменеНовыхКурсовСтарыми.Видимость = ЕстьКурсыДляЗамены И ЕстьКурсыДляЗаменыНовых;

КонецПроцедуры

&НаКлиенте
Процедура ОпределитьЕстьЛиКурсыДляЗамены(ЕстьКурсыДляЗамены, ЕстьКурсыДляЗаменыНовых)	
	
	ЕстьКурсыДляЗамены = Ложь;
	ЕстьКурсыДляЗаменыНовых = Ложь;
	
	Для каждого Строка Из ЭлектронныеКурсы Цикл
	
		Если НЕ Строка.Загружать Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Строка.ДатаИзмененияВБазе) Тогда
			
			ЕстьКурсыДляЗамены = Истина;
			
			Если Строка.ДатаИзмененияНаДиске < Строка.ДатаИзмененияВБазе Тогда
				ЕстьКурсыДляЗаменыНовых = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;	
	
КонецПроцедуры

#КонецОбласти
